# Дана строка. Преобразовать в ней все прописные латинские буквы в строчные.
input_string = input("Введите строку: ")
lowercase_string = input_string.lower()
print(lowercase_string)
