info_all = [
    (1, "Сделать отчет по продажам", "2023-03-08", "2023-03-15", "Иванов И.И."),
    (2, "Подготовить презентацию для совещания", "2023-03-10", "2023-03-17", "Петрова А.С."),
    (3, "Провести переговоры с клиентом", "2023-03-15", "2023-03-22", "Сидоров В.В."),
    (4, "Закупить канцтовары", "2023-03-17", "2023-03-24", "Кузнецова Е.А."),
    (5, "Отправить письма клиентам", "2023-03-20", "2023-03-27", "Иванов И.И."),
    (6, "Подготовить отчет по маркетинговой кампании", "2023-03-22", "2023-03-29", "Петрова А.С."),
    (7, "Провести обучение сотрудников", "2023-03-24", "2023-04-01", "Сидоров В.В."),
    (8, "Разработать новый продукт", "2023-03-27", "2023-04-04", "Кузнецова Е.А."),
    (9, "Провести инвентаризацию склада", "2023-03-29", "2023-04-06", "Иванов И.И."),
    (11, "Подготовить финансовый отчет", "2023-03-31", "2023-04-08", "Петрова А.С."),
]
